_protected/models/FoodImageQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `food_image` WHERE 0=1