_protected/models/OrderQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `order` ORDER BY `id`