_protected/models/OrderItemQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `order_item` WHERE 0=1